import React, { useState } from 'react'
import { cn } from '@/utils/dom'
import Collapse from '@/components/ui/Collapse'
import { PlusIcon } from '@/components/icons'

const categories = [
  { title: 'کد رهگیری', key: 'trackingCode' },
  { title: 'سوالات مالک ها', key: 'ownersQuestions' },
  { title: 'املاین', key: 'amline' },
  { title: 'عمومی', key: 'general' },
  { title: 'قرارداد اجاره', key: 'rentalAgreement' },
]

const questions = {
  trackingCode: [
    {
      label: 'برای اجاره نامه، حتما باید کد رهگیری بگیرم؟',
      answer:
        'بله؛ قانون الزامی کرده، هر چند برخی افراد از دریافت این کد رهگیری امتناع می کنن\nگرفتن کد رهگیری مزیت های زیادی داره از جمله اینکه:\n1- قراردادهای با کد رهگیری از نظر دولت رسمیت داره و امکان ادعای جعل در اون ها پذیرفته نمیشه.\n2- اگر مستاجر هستید بهتره که بدونین، اخیراً بانک مرکزی در دستورالعملی ابلاغ کرده که شرط دریافت، دست چک، ثبت اطلاعات افراد در سامانه املاک و اسکان هست و اگر مستاجر باشید عملاً باید کد رهگیری داشته باشید.\n3- برای دریافت وام رهن و اجاره، دریافت کد رهگیری الزامی است.\n4- برای ثبت نام دانش آموزان در مدارس، به خصوص مدارس دولتی، دریافت کد رهگیری الزامی است.',
    },
    {
      label: 'شرایط و مدارک دریافت کد رهگیری چیه؟',
      answer:
        'ابتدا باید قراردادت رو توی املاین بنویسی و بعد از اینکه قراردادت تمام شد کافیه با تیم املاین ارتباط بگیری و شناسه قبض برق ملک رو برای ما ارسال کنی. بعد هم املاین برات کدرهگیری قراردادت رو میگیره. به همین راحتی!',
    },
    {
      label: 'هزینه دریافت کد رهگیری اجاره نامه چقدره؟',
      answer:
        'رایگان! بدون اینکه حتی یک ریال بخوای پرداخت کنی، املاین برات کدرهگیری میگیره. کافیه فقط قراردادت رو در املاین نوشته باشی.',
    },
  ],
  ownersQuestions: [
    {
      label: 'کارمزد املاین برای انعقاد قرارداد چه قدر است؟',
      answer:
        'کارمزد انعقاد قرارداد رو اتحادیه املاک هر استانی مشخص می کنه؛ اما املاین هزینه رو خیلی کمتر از اون چیزی که در عرف املاک هست، محاسبه می کنه.\nبه صورت کلی در جریان باشید که به ازای هر یک میلیون تومان مبلغ رهن، 6000 تومان کمیسیون محاسبه می شود.\nاز طرفی یک سوم مبلغ اجاره ماهانه نیز به عنوان کمیسیون جمع می شود که در نهایت ده درصد نیز به عنوان مالیات بر ارزش افزوده به مبلغ کمیسیون قرارداد اضافه می شود.\nبه عنوان مثال اگر رهن و اجاره ملکی، 100 میلیون تومان رهن و 5 میلیون تومان اجاره باشد:\nکمیسیون دریافتی برای این ملک 600 هزار تومان برای رهن و 1.666.000 تومان برای اجاره محاسبه می شود.\nکه در مجموع 2.266.000 تومان هزینه کمیسیون می باشد.\nبه این مبلغ 10 درصد مالیات ارزش افزوده اضافه می شود که جمع نهایی کمیسیون 2.492.600 تومان می باشد.\nاز آنجا که طبق عرف پرداخت کمیسیون به صورت مساوی با طرفین قرارداد می باشد، کمیسیون نهایی تقسیم بر دو طرف قرارداد می شود.\nکه به این معنی است، کارمزد نهایی برای هریک از موجر یا مستاجر حدود 1.246.000 تومان می شود.',
    },
  ],
  amline: [
    {
      label: 'چرا در املاین قرارداد بنویسم؟',
      answer:
        '1- در کمتر از 7 دقیقه قرارداد بنویس و دیگه نیازی نیست برای قرارداد اجاره به صورت حضوری به دفاتر املاک مراجعه کنی.\n2- می‌تونی بدون اینکه هزینه بیشتری پرداخت کنی، از تضمین پرداخت اجاره بها استفاده کنی! یعنی اگر به هر دلیلی مستاجر نتونست اجاره رو پرداخت کنه، املاین مبلغ اجاره رو به مالک میده و بعداً از مستاجر اجاره رو دریافت می‌کنه.\n3- دیگه برای جا‌به‌جایی مبالغ رهن و اجاره نیاز نیست تا بانک بری! می‌تونی به صورت آنلاین و امن واریز کنی.\n4- کد رهگیری قرارداد رو هم به صورت آنلاین دریافت می‌کنی و دیگه نیاز نیست به سامانه‌های دیگه مراجعه کنی!\n5- مورد تایید قوه قضاییه هستم و خیالت از اعتبار قرارداد راحته!',
    },
    {
      label: 'چطور اعتماد کنم؟',
      answer:
        '1- کافیه مجوزهای املاین رو از (صفحه مجوزها) بررسی کنین و حتی استعلام بگیرید.\n2- تمام کد رهگیری‌هایی که برای قراردادها صادر میشه، رو می‌تونین از سایت وزارت راه و مسکن استعلام بگیرید و از اصالت محتوای قراردادها خیالتون راحت باشه.\n3- می‌تونین نظرات مدیران شرکت‌ها یا مشتری‌های املاین رو از تجربه‌های لذت‌بخشی که در املاین داشتن رو در شبکه‌های اجتماعی مطالعه کنین.\n4- جوایز و افتخارات شرکت املاین رو از (صفحه افتخارات املاین) مشاهده بفرمایید.\n5- از (صفحه درباره ما) با تاریخچه شرکت، مأموریت‌ها، ارزش‌ها و چشم‌اندازهای املاین آشنا بشید.\n6- می‌تونین از (صفحه اطلاعات تماس) در هر لحظه با پشتیبانی شرکت ارتباط برقرار کنید یا به صورت حضوری به شعبات فیزیکی املاین مراجعه بفرمایید.',
    },
    {
      label: 'مجوزهای املاین',
      answer:
        '1- شرکت املاین در سال 1402 به صورت رسمی در اداره ثبت شرکت‌های قوه قضاییه به شماره 23567 ثبت شده.\n2- مجوز رسمی از وزارت صنعت، معدن و تجارت دریافت کرده (لینک صفحه)\n3- عضو رسمی اتحادیه کسب و کارهای مجازی کشور\n4- عضو رسمی سازمان نظام صنفی رایانه‌ای کشور\n5- شرکت منتخب فناور مرکز رشد دانشگاه قم\n6- مجوز رسمی از اینماد وزارت صمت برای درگاه معاملاتی امن',
    },
    {
      label: 'خدمات املاین',
      answer:
        '1- کمتر از 7 دقیقه قرارداد رهن و اجاره بنویس\n2- کمیسیون قانونی املاک رو محاسبه کن\n3- آنلاین کد رهگیری قرارداد اجاره رو دریافت کن\n4- بدون مراجعه به بانک، پول رهن و اجاره رو جا به جا کن\n5- املاین، پرداخت به موقع اجاره مستاجرت رو تضمین می‌کنه',
    },
  ],
  general: [
    {
      label: 'چطور می‌تونم حساب کاربری باز کنم؟',
      answer:
        '۱- اپلیکیشن املاین رو دانلود و نصب کنید (لینک صفحه‌ی دانلود)\n۲- با خط تلفنی که به‌نام خودتان و فعال است، ثبت‌نام را شروع کنید\n۳- کافیه اطلاعات تان، مانند کد ملی و آدرس تون رو وارد کنید.',
    },
    {
      label: 'هزینه قرارداد نوشتن در املاین چقدر است؟',
      answer:
        'به راحتی می‌تونین از بخش محاسبه کمیسیون قرارداد، تعرفه قرارداد رو مشاهده کنید (لینک صفحه‌ی محاسبه کمیسیون).',
    },
    {
      label: 'هزینه افتتاح حساب کاربری در املاین چقدر است؟',
      answer: 'باز کردن حساب کاربری و کیف پول الکترونیک هیچ هزینه‌ای نداره و کاملا رایگانه!',
    },
    {
      label: 'طرح‌ها و شرایط دریافت وام از املاین چطور هست؟',
      answer:
        'فعلاً این امکان در املاین در حال پیگیری هست و به زودی اطلاع‌رسانی‌های لازم انجام می‌شود.',
    },
    {
      label: 'املاین با یه املاک سنتی چه تفاوتی داره؟',
      answer:
        'وقتی شما تو املاین قرارداد می‌بندید یه سری امتیازاتی داره که تجربه رهن و اجاره ملک رو براتون شیرین می‌کنه:\nاول اینکه وقتی تو املاین قرارداد می‌نویسی نباید نگران هزینه کمیسیون باشی، چون حق کمیسیون قانونی اتحادیه املاک رو می‌گیره بدون یک ریال بیشتر…\nدوم، ضمانت اجاره‌بهاست، هیچ املاکی برات اینکارو نمی‌کنه که اجاره مستاجر رو بیمه کنه و اگه مستاجر اجاره رو نداد به جاش پرداخت کنه، اما املاین اینکارو می‌کنه.\nسوم هم بحث داوریه، اگر به هر دلیلی با طرف مقابلت به مشکل بخوری املاین برات سازوکار داوری رو ایجاد کرده که دیگه لازم نباشه پله‌های دادگاهو بالا پایین کنی و کلی وقت معطل بشی تا به خواستت برسی. املاین هر مشکلی داشته باشی زیر ۲ هفته توسط تیم حقوقی بررسی می‌کنه و حکم لازم‌الاجرا صادر می‌کنه.',
    },
    {
      label: 'املاین خونه هم اجاره می‌ده؟',
      answer:
        'بله، اما نه برای کل کشور!\nدر حال حاضر این سرویس به صورت آزمایشی در استان قم در حال تست و بررسی است و در صورت تایید مدیران، سایر شهرهای ایران هم به زودی پیاده‌سازی خواهد شد.',
    },
    {
      label: 'املاین شعبه حضوری هم داره؟',
      answer:
        'بله؛ البته باید قبل از حضور در شعبات املاین، با تیم پشتیبانی هماهنگ بفرمایید تا به جهت حجم مراجعه‌کننده‌ها، معطل نشوید.',
    },
  ],
  rentalAgreement: [
    {
      label: 'قرارداد آنلاین چقدر اعتبار داره؟',
      answer:
        'همین قدر بگیم که قوه قضاییه تمام قراردادهای اجاره‌ای رو که آنلاین تدوین شدن و کد رهگیری از وزارت راه و مسکن دارن، بسیار معتبر می‌دونه و طی نامه‌ای که رئیس قوه قضاییه به روسای دادگستری استان‌ها ارسال کرده، اعتبار این قراردادها رو به صورت ویژه تاکید کردن؛ مطابق با قراردادهایی که در املاین نوشته می‌شه.',
    },
    {
      label: 'روند انعقاد قرارداد در املاین چطور است؟',
      answer:
        '۱- مالک و مستاجر اطلاعات مربوط به طرفین قرارداد و ملک را به صورت کامل وارد می‌کنند.\n۲- تاریخ، مبلغ و نحوه پرداخت را در قرارداد مشخص می‌کنند.\n۳- طرفین قرارداد را با رمز پویا امضا و پس از تایید کارشناس حقوقی املاین، نسخه قرارداد را دریافت می‌کنند.',
    },
    {
      label: 'قراردادها در املاین چطوری امضا میشه؟',
      answer:
        'امضای قراردادها به صورت رمز پویا هست که مستقیماً به شماره موبایل طرفین قرارداد ارسال می‌شه؛ دقیقاً مثل زمانی که شما در حال کارت به کارت پول از گوشی همراه خودتون هستید و برای اینکه بانک تایید نهایی رو از شما بگیره تا پول رو جا به جا کنه، برای شما پیامک رمز پویا ارسال می‌کنه و شما اون کد ارسالی رو وارد موبایل بانک می‌کنید، بانک این کد یا رمز رو به عنوان امضا و تایید انتقال پول تلقی می‌کنه.\nدقیقاً همین فرایند در املاین محقق می‌شه و قانون اعتبار این امضا را از امضای فیزیکی بالاتر می‌داند، چراکه قابلیت جعل در این فرایند وجود ندارد و این امضاها علاوه بر امکان استعلام صحت امضا، از امنیت دیجیتالی بالایی برخوردار هستند.',
    },
    {
      label: 'فرایند نوشتن قرارداد اول توسط مالک شروع میشه یا مستاجر؟',
      answer:
        'هم مالک و هم مستاجر می‌تونن قرارداد رو اول شروع کنن و تفاوتی از این نظر وجود نداره؛ اما توصیه می‌کنیم ابتدا قرارداد توسط مالک شروع بشه و امضا رو انجام بده تا روند زمانی کمتری طی بشه.',
    },
    {
      label: 'برای اینکه قرارداد اجاره رو بنویسیم، باید حضوری قرارداد بنویسیم؟',
      answer:
        'برای نوشتن قراردادهای اجاره در املاین، اصلاً نیازی به حضور فیزیکی افراد نیست! مثلا مالک می‌تونه تهران باشه و مستاجر هم در شیراز باشه، ملک هم قم باشه؛ حالا توی کمتر از ۷ دقیقه و آنلاین قراردادتون رو بنویسین.',
    },
    {
      label: 'چطور میتونم بند های قرارداد رو ویرایش کنم؟',
      answer:
        'بعد از اینکه بخش اطلاعات طرفین و اطلاعات ملک تکمیل شد و مدت و زمانبندی اقساط را تکمیل کردی وارد صفحه مدیریت قرارداد میشی. اونجا یک سری از بند های قرارداد که قابل تغییر هستن رو می‌تونی ویرایش کنی یا حتی بند جدید اضافه کنی. نگران نباش چون همه قرارداد هایی که توی املاین نوشته می‌شن توسط کارشناس حقوقی چک می‌شن و در نهایت تایید می‌شن.',
    },
    {
      label: 'آیا میتونم نسخه فیزیکی قراردادم را ببینم؟',
      answer:
        'بله؛ می‌تونید بعد از اینکه قراردادتون رو نوشتید، فایل pdf قراردادتون رو دانلود و پرینت کنید.',
    },
    {
      label: 'چه ساعت هایی از روز می تونیم قرارداد بنویسیم؟',
      answer:
        'به راحتی می‌تونی هر ساعت از شبانه روز قرارداد بنویسی و اگر نیاز به راهنمایی داشتی، تیم پشتیبانی املاین کاملاً در خدمت شماست.',
    },
    {
      label: 'برای نوشتن قرارداد رهن و اجاره، چه مدارکی نیاز هست؟',
      answer:
        '۱- موجر و مستاجر، در اپلیکیشن املاین حساب کاربری ایجاد کنند.\n۲- کافیه تصویر واضح از سند ملک رو در بخش اطلاعات ملک بارگذاری کنید.\n۳- در صورتی که وکیل طرفین در قرارداد باشید، بارگذاری تصویر وکالت‌نامه الزامی است.',
    },
    {
      label: 'آیا اشخاص حقوقی نیز می توانند در املاین قرارداد بنویسند؟',
      answer: 'به زودی این امکان در املاین فراهم می‌شود.',
    },
    {
      label: 'چطوری می تونم اصالت قرارداد رو استعلام بگیرم؟',
      answer:
        '۱- توی فایل pdf قرارداد، یه QR کد وجود داره که با اسکن کردن اون توسط دوربین موبایل تون، می‌تونید از اصالت قرارداد تون مطمئن بشید.\n۲- هر قرارداد یه شماره سریال و یه رمز داره که می‌تونین برای اینکه در جریان اصالت قرارداد قرار بگیرید، وارد (صفحه استعلام اصالت قرارداد) بشید و با وارد کردن سریال و رمز، در جریان اصالت قرارداد قرار بگیرید.\n۳- در صورتی که تا آخرین مرحله قرارداد، پیش رفته باشید، برای قرارداد شما کد رهگیری از سامانه وزارت مسکن و شهرسازی دریافت شده که می‌تونین با وارد شدن به سامانه وزارت مسکن و شهرسازی و درج سریال در سایت، استعلام اصالت قرارداد رو دریافت کنید.',
    },
  ],
}

function CollapseBox({ children, label }) {
  const [isOpen, setIsOpen] = useState(false)

  return (
    <div className="flex flex-col">
      <button
        type="button"
        aria-expanded={isOpen}
        onClick={() => setIsOpen(!isOpen)}
        className={cn('flex items-center gap-2 pt-4 pl-8', isOpen ? 'pb-3' : 'pb-4')}
      >
        <PlusIcon
          size={22}
          color="#179A9C"
          className={cn('transition-all duration-300 shrink-0', isOpen && '-rotate-45 ')}
        />
        <span className="font-medium text-right">{label}</span>
      </button>

      <Collapse in={isOpen} className="pb-3 text-sm text-justify leading-6 fa whitespace-pre-line">
        {children}
      </Collapse>

      <div className="h-px bg-[#D2D2D2]" />
    </div>
  )
}

function Faq({ className }) {
  const [activeCategory, setActiveCategory] = useState('trackingCode')

  return (
    <div className={className} id="faq">
      <h5 className="text-lg font-medium text-center">سوالی برات پیش اومده؟</h5>
      <p className="max-w-[280px] mx-auto text-sm text-[#8B8B8B] text-center">
        اگر جوابت رو پیدا نکردی میتونی با کارشناسان املاین ارتباط بگیری تا اونا کمکت کنن.
      </p>

      <div className="relative">
        <div
          className="absolute top-0 left-0 w-full h-full "
          style={{
            background: 'linear-gradient(90deg, rgba(244,249,249,1) 0%, rgba(244,249,249,0) 30%)',
            pointerEvents: 'none',
          }}
        />

        <div className="overflow-y-auto no-scrollbar mt-7">
          <ul className="flex gap-2">
            {categories.map((category, index) => (
              <li
                key={category.key}
                className={index === categories.length - 1 ? 'pl-14' : undefined}
              >
                <button
                  type="button"
                  onClick={() => setActiveCategory(category.key)}
                  className={cn(
                    'text-[#747474] whitespace-nowrap border border-transparent px-3 py-1 bg-[#E7E7E7] rounded-full',
                    {
                      'bg-[#AEDCDC] text-[#006768] border-[#006768]':
                        activeCategory === category.key,
                    }
                  )}
                >
                  {category.title}
                </button>
              </li>
            ))}
          </ul>
        </div>
      </div>

      <div className="flex flex-col mt-7">
        {questions[activeCategory].map((question) => (
          <CollapseBox label={question.label} key={question.label}>
            {question.answer}
          </CollapseBox>
        ))}
      </div>
    </div>
  )
}

export default Faq
