# flake8: noqa E501


OTP = """
کد تایید املاین: {token}

@app.amline.ir #{token}
iwYXOdVdEQ6
"""

CustomPayment = """
لینک پرداخت شما در املاین ایجاد شد.
https://api.amline.ir/financials/cp/{token}
املاین
"""

SignContractOTP = """
شما در حال امضای قرارداد شماره {token2} با «{token10}» هستید.
کد امضا: {token}

املاین
"""

WelcomeMessage = """
ثبت‌نامت انجام شد! خوش اومدی به املاین.
املاین پلفرم قرارداد آنلاین 
app.amline.ir
"""

ContractReminder = """
کاربر گرامی، فرایند تکمیل قرارداد شما با شناسه {contract_id} ناتمام مانده است. در صورت نیاز به راهنمایی، کارشناسان ما آماده ارائه کمک هستند.
املاین پلتفرم قرارداد آنلاین
پشتیبانی : ‌02532048000
app.amline.ir
"""

OwnerMustSign = """
مالک گرامی قرارداد ملکی جدیدی توسط «{token10}» برای شما ثبت شده و منتظر تایید و امضای شماست. مشاهده و تایید قرارداد: https://app.amline.ir/contracts/{token}
املاین؛ املاک آنلاین
"""

RenterMustSign = """
مستاجر گرامی قرارداد ملکی جدیدی توسط «{token10}» برای شما ثبت شده و منتظر تایید و امضای شماست. مشاهده و تایید قرارداد: https://app.amline.ir/contracts/{token}
املاین؛ املاک آنلاین
"""

SecondSideSigned = """
قرارداد شما توسط طرف مقابل امضا شد. ادامه روند قرارداد از لینک زیر: https://app.amline.ir/contracts/{token}
املاین؛ املاک آنلاین
"""

SecondSideRejected = """
قرارداد شما توسط «{token10}» رد شد. مشاهده قرارداد: https://app.amline.ir/contracts/{token}
املاین؛ املاک آنلاین
"""

RevisionRequest = """
«{token10}» درخواست ویرایش قرارداد را دارد.
کارشناسان املاین به زودی با شما تماس میگیرند.
مشاهده قرارداد: https://app.amline.ir/contracts/{token}
املاین؛ املاک آنلاین
"""

WalletCharge = """
کاربر عزیز،
کیف پولت {token} تومن شارژ شده و موجودی فعلیت {token2} تومنه.
میتونی از app.amline.ir بهش دسترسی داشته باشی.
املاین؛ املاک آنلاین
"""
InvoiceLink = """
{token} رو به مبلغ {token2} تومان با لینک زیر پرداخت کن :
{token3}
املاین؛ املاک آنلاین
"""


PaymentBeforeAlert = """
سلام، فردا به تاریخ {token}، موعد پرداخت {token4} شما به مبلغ {token2} تومان است.
از طریق لینک زیرمیتوانید اقساط خود را مشاهده و پرداخت کنید: {token3}
"""

PaymentAfterAlert = """
سلام، یک روز از موعد پرداخت {token4} شما گذشته است.اگر پرداخت را انجام داده‌اید، لطفاً فیش واریز را در بخش اقساط قرارداد بارگذاری کنید.
در غیر این صورت، از طریق لینک زیر اقدام به پرداخت نمایید:
مشاهده اقساط قرارداد: {token3}
"""

BothCommissionsPaid = """
پرداخت کمیسیون مربوط به قرارداد شماره {token} با موفقیت انجام شد. لطفاً منتظر تأیید نهایی قرارداد توسط کارشناس حقوقی املاین باشید. {token2}
"""

LandlordCommissionPaid = """
مالک قرارداد {token} ،مبلغ  کمیسیون را پرداخت کرده است. لطفاً از طریق لینک زیر، پرداخت خود را انجام دهید: {token2}
"""

TenantCommissionPaid = """
مستاجر قرارداد {token} ،مبلغ  کمیسیون را پرداخت کرده است. لطفاً از طریق لینک زیر، پرداخت خود را انجام دهید: {token2}
"""

PaymentBeforeAlertRegularContract = """
سلام، فردا، به تاریخ {token}، موعد پرداخت {token4} شما به مبلغ {token2} تومان است.
اگر هنوز اجاره را پرداخت نکرده اید  از طریق لینک زیر به کمک املاین  می‌توانید اجاره خود را پرداخت کنید: {token3}
"""

EitaaYarInformingTitle = "اطلاع رسانی امضای قرارداد {contract_id}"

EitaaYarInformingText = """
🆕 قرارداد جدید امضا شد

ℹ️ شناسه قرارداد: <b>{contract_id}</b>
ℹ️ طرف قرارداد: <b>{contract_party}</b>
ℹ️ نوع امضا: <b>{signature_type}</b>

👤 کاربر: <b>{user_full_name}</b>
📞 شماره تلفن کاربر: <b>{user_mobile}</b>
"""

Landlord = "موجر"
Tenant = "مستاجر"