import { cn } from '@/lib/utils'
import {
  Accordion,
  AccordionItem,
  AccordionTrigger,
  AccordionContent,
} from '@/components/ui/accordion'

export type Question = {
  label: string
  answer: string
}

export const FAQ = ({
  className,
  questions = [
    {
      label: 'قرارداد آنلاین چقدر اعتبار دارد؟',
      answer:
        'قوه قضاییه تمام قراردادهای اجاره‌ای رو که آنلاین تدوین شدن و کد رهگیری از وزارت راه و مسکن دارن، بسیار معتبر می‌دونه و طی نامه‌ای که رئیس قوه قضاییه به روسای دادگستری استان‌ها ارسال کرده، اعتبار این قراردادها رو به صورت ویژه تاکید کردن؛ مطابق با قراردادهایی که در املاین نوشته می‌شه.',
    },
    {
      label: 'امضای قرارداد چطور انجام می‌شود؟',
      answer:
        'امضای قراردادها به صورت رمز پویا هست که مستقیماً به شماره موبایل طرفین قرارداد ارسال می‌شه؛ دقیقاً مثل زمانی که شما در حال کارت به کارت پول از گوشی همراه خودتون هستید و برای اینکه بانک تایید نهایی رو از شما بگیره تا پول رو جا به جا کنه، برای شما پیامک رمز پویا ارسال می‌کنه و شما اون کد ارسالی رو وارد موبایل بانک می‌کنید، بانک این کد یا رمز رو به عنوان امضا و تایید انتقال پول تلقی می‌کنه.\nدقیقاً همین فرایند در املاین محقق می‌شه و قانون اعتبار این امضا را از امضای فیزیکی بالاتر می‌داند، چراکه قابلیت جعل در این فرایند وجود ندارد و این امضاها علاوه بر امکان استعلام صحت امضا، از امنیت دیجیتالی بالایی برخوردار هستند.',
    },
    {
      label: 'آیا می‌توانم نسخه فیزیکی قراردادم را ببینم؟',
      answer:
        'بله؛ می‌تونید بعد از اینکه قراردادتون رو نوشتید، فایل pdf قراردادتون رو دانلود و پرینت کنید.',
    },
    {
      label: 'برای نوشتن قرارداد چه مدارکی لازم است؟',
      answer:
        '1- موجر و مستاجر، در اپلیکیشن املاین حساب کاربری ایجاد کنند.\n2- کافیه تصویر واضح از سند ملک رو در بخش اطلاعات ملک بارگذاری کنید.\n3- در صورتی که وکیل طرفین در قرارداد باشید، بارگذاری تصویر وکالت‌نامه الزامی است.',
    },
    {
      label: 'هزینه نوشتن قرارداد در املاین چقدر است؟',
      answer:
        'کارمزد انعقاد قرارداد رو اتحادیه املاک هر استانی مشخص می کنه؛ اما املاین هزینه رو خیلی کمتر از اون چیزی که در عرف املاک هست، محاسبه می کنه.\nبه صورت کلی در جریان باشید که به ازای هر یک میلیون تومان مبلغ رهن، 6000 تومان کمیسیون محاسبه می شود.\nاز طرفی یک سوم مبلغ اجاره ماهانه نیز به عنوان کمیسیون جمع می شود که در نهایت ده درصد نیز به عنوان مالیات بر ارزش افزوده به مبلغ کمیسیون قرارداد اضافه می شود.\nبه عنوان مثال اگر رهن و اجاره ملکی، 100 میلیون تومان رهن و 5 میلیون تومان اجاره باشد:\nکمیسیون دریافتی برای این ملک 600 هزار تومان برای رهن و 1.666.000 تومان برای اجاره محاسبه می شود.\nکه در مجموع 2.266.000 تومان هزینه کمیسیون می باشد.\nبه این مبلغ 10 درصد مالیات ارزش افزوده اضافه می شود که جمع نهایی کمیسیون 2.492.600 تومان می باشد.\nاز آنجا که طبق عرف پرداخت کمیسیون به صورت مساوی با طرفین قرارداد می باشد، کمیسیون نهایی تقسیم بر دو طرف قرارداد می شود.\nکه به این معنی است، کارمزد نهایی برای هریک از موجر یا مستاجر حدود 1.246.000 تومان می شود.',
    },
    {
      label: 'چطور می‌توانم استعلام اصالت قرارداد را بگیرم؟',
      answer:
        '1- توی فایل pdf قرارداد، یه QR کد وجود داره که با اسکن کردن اون توسط دوربین موبایل تون، می‌تونید از اصالت قرارداد تون مطمئن بشید.\n2- هر قرارداد یه شماره سریال و یه رمز داره که می‌تونین برای اینکه در جریان اصالت قرارداد قرار بگیرید، وارد (صفحه استعلام اصالت قرارداد) بشید و با وارد کردن سریال و رمز، در جریان اصالت قرارداد قرار بگیرید.\n3- در صورتی که تا آخرین مرحله قرارداد، پیش رفته باشید، برای قرارداد شما کد رهگیری از سامانه وزارت مسکن و شهرسازی دریافت شده که می‌تونین با وارد شدن به سامانه وزارت مسکن و شهرسازی و درج سریال در سایت، استعلام اصالت قرارداد رو دریافت کنید.',
    },
  ],
}: {
  className?: string
  questions?: Question[]
}) => {
  return (
    <section className={cn('container', className)}>
      <div className="mx-auto xl:w-5/6">
        <h2 className="mb-6 text-center text-xl font-bold text-stone-900 sm:mb-12 sm:text-2xl md:mb-16 md:text-3xl">
          سوالات متداول
        </h2>

        <Accordion type="single" collapsible>
          {questions.map((question, idx) => (
            <AccordionItem value={`faq-${idx}`} key={question.label}>
              <AccordionTrigger className="fa text-black sm:text-lg">
                {question.label}
              </AccordionTrigger>
              <AccordionContent className="fa pr-8 text-justify leading-6 whitespace-pre-line text-black md:text-base">
                {question.answer}
              </AccordionContent>
            </AccordionItem>
          ))}
        </Accordion>
      </div>
    </section>
  )
}
